# 1. Создать генератор для заполнения списка
# 2. Создать функцию для генерации списков с аннотациями
# 3. *Сделать функцию которая будет вызываться из генератора и отдавать текущее время

a = int(input("Коль-во чисел: "))
def listgen(list: list) -> list:
    list = [i for i in range(a)]
    print(list)
listgen(list)